In [2]:
import pandas as pd
print(pd.__version__)

1.0.5

In [3]:
data = {
    "names" : ["관영","로니","토리"],
    "age": [30,24,58],
    "addr": ['서울','부산','대전']
}
#dataframe 객체 생성
data_df = pd.DataFrame(data)
data_df.head()

  names  age addr
0    관영   30   서울
1    로니   24   부산
2    토리   58   대전

In [4]:
for idx, row in data_df.iterrows():
    print(type(row))
    print(idx, row['addr'])

<class 'pandas.core.series.Series'>
0 서울
<class 'pandas.core.series.Series'>
1 부산
<class 'pandas.core.series.Series'>
2 대전

In [5]:
#컬럼추가
data_df['phone'] = ['010-3456-9516','010-3221-4432','010-9983-0112']
data_df

  names  age addr          phone
0    관영   30   서울  010-3456-9516
1    로니   24   부산  010-3221-4432
2    토리   58   대전  010-9983-0112

In [6]:
#컬럼추가2
data_df['gender']=['men','men','women']
data_df

  names  age addr          phone gender
0    관영   30   서울  010-3456-9516    men
1    로니   24   부산  010-3221-4432    men
2    토리   58   대전  010-9983-0112  women

In [24]:
data_df['seq'] = range(1,len(data_df)+1)
data_df

  names  age addr          phone  seq
0    관영   30   서울  010-3456-9516    1
1    로니   24   부산  010-3221-4432    2
2    토리   58   대전  010-9983-0112    3

In [4]:
#나이 최대값,최소,평균,중간
print('최대',data_df['age'].max())
print('최소',data_df['age'].min())
print('평균',data_df['age'].mean())
print('중간',data_df['age'].median())
print('카운트',data_df['age'].count())

최대 58
최소 24
평균 37.333333333333336
중간 30.0
카운트 3

In [5]:
data_df.describe()

             age
count   3.000000
mean   37.333333
std    18.147543
min    24.000000
25%    27.000000
50%    30.000000
75%    44.000000
max    58.000000

In [6]:
data_df.tail(1)

  names  age addr
2    토리   58   대전

In [7]:
print('몇행 몇열',data_df.shape)
print('컬럼명',data_df.columns)
print('인덱스',data_df.index)
print('값들',data_df.values,type(data_df.values))

몇행 몇열 (3, 3)
컬럼명 Index(['names', 'age', 'addr'], dtype='object')
인덱스 RangeIndex(start=0, stop=3, step=1)
값들 [['관영' 30 '서울']
 ['로니' 24 '부산']
 ['토리' 58 '대전']] <class 'numpy.ndarray'>

In [8]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   age     3 non-null      int64
 2   addr    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [9]:
# names 컬럼의 값들을 선택해라 select names from table명
#한개의 열(컬럼)을 선택
print(type(data_df['names']))
data_df['names']

<class 'pandas.core.series.Series'>

0    관영
1    로니
2    토리
Name: names, dtype: object

In [10]:
#한개의 행(로우)을 선택
print(type(data_df.loc[0]))
data_df.loc[0]

<class 'pandas.core.series.Series'>

names    관영
age      30
addr     서울
Name: 0, dtype: object

In [11]:
#Series 객체생성
series1 = pd.Series([10,20,30])
series1

0    10
1    20
2    30
dtype: int64

In [12]:
series2 = pd.Series({'title':'Dynamite','가수':'방탄'})
series2

title    Dynamite
가수             방탄
dtype: object

In [13]:
song_list=[
    {'title':'Dynamite','가수':'방탄'},
    {'title':'Girl','가수':'블랙핑크'}
]

#비어있는 DataFrame 객체
data_df = pd.DataFrame(columns =['title','가수'])
data_df

Empty DataFrame
Columns: [title, 가수]
Index: []

In [14]:
for song in song_list:
    series_obj =pd.Series(song)
    #Series 객체를 DataFrame 객체에 추가
    data_df = data_df.append(series_obj,ignore_index=True)
data_df

      title    가수
0  Dynamite    방탄
1      Girl  블랙핑크

### Numpy 사용법

In [15]:
import numpy as np

np.arange(1,10+1)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [16]:
for val in np.arange(1,10+1):
    print(val)

1
2
3
4
5
6
7
8
9
10